package com.git.kathyBeh.battleShips.view

import javafx.geometry.Insets
import javafx.scene.image.ImageView
import javafx.scene.layout.Background
import javafx.scene.layout.BackgroundFill
import javafx.scene.layout.CornerRadii
import javafx.scene.layout.BorderPane
import javafx.scene.paint.Color
import javafx.scene.text.Font
import tornadofx.*


class HelpWindow : View() {
    override val root = BorderPane()

    init {
        title = "Game rules"
        with(root) {
            background = Background(
                BackgroundFill(Color.WHITESMOKE , CornerRadii.EMPTY, Insets.EMPTY)
            )
            top {
                val t = label(
                    "Правила размещения кораблей (флота):\n" +
                            "Игровое поле — квадрат 10×10 у каждого игрока, на котором размещается флот кораблей.\n" +
                            "Размещаются:\n" +
                            "    • 1 корабль — ряд из 4 клеток («четырёхпалубный»)\n" +
                            "    • 2 корабля — ряд из 3 клеток («трёхпалубные»)\n" +
                            "    • 3 корабля — ряд из 2 клеток («двухпалубные»)\n" +
                            "    • 4 корабля — 1 клетка («однопалубные»).\n" +
                            "При размещении корабли не могут касаться друг друга сторонами и углами.\n" +
                            "При нажатии правой кнопки мыши корабль располагается по горизонтали, левой - по вертикали. Расположение кораблей начинается с четырёхпалубного, \n " +
                            "далее два трёхпалубных, три двухпалубных и четыре однопалубных.\n" +
                            "Рядом со «своим» полем располагается «чужое» такого же размера, только пустое. Это участок моря, где плавают корабли противника.\n" +
                            "При попадании в корабль противника — на чужом поле ставится круг оранжевого цвета, при холостом выстреле — круг темно-синего цвета. \n" +
                            "Попавший стреляет ещё раз.\n" +
                            "Потопление кораблей противника:\n" +
                            "Игрок, выполняющий ход, совершает выстрел — выбирает мышкой  клетку на поле противника, в которой, по его мнению, находится корабль противника.\n" +
                            "    1. Если выстрел пришёлся в клетку, не занятую ни одним кораблём противника, то следует ответ «Miss» и данная клетка помечается \n " +
                            "кружочком темно-синего цвета. Право хода переходит к сопернику.\n" +
                            "    2. Если выстрел пришёлся в клетку, где находится многопалубный корабль (размером больше чем 1 клетка), то следует ответ «Hit», \n " +
                            "кроме одного случая (см. пункт 3). Эта клетка помечается кружочком оранжевого цвета. Стрелявший игрок получает право на ещё один выстрел.\n" +
                            "    3. Если выстрел пришёлся в клетку, где находится однопалубный корабль, или последнюю непоражённую клетку многопалубного корабля, \n " +
                            "то следует ответ «Kill».  Стрелявший игрок получает право на ещё один выстрел.\n" +
                            "Победителем считается тот, кто первым потопит все 10 кораблей противника.\n" +
                            "Кнопка \"Random\" позволяет расставить корабли в произвольном порядке.\n" +
                            "Кнопка \"Restart\" перезапускает игру.\n" +
                            "Кнопка \"Close\" закрывает игровое окно и игру.\n"
                )
                t.font = Font("Arial", 20.0)
                t.textFill = Color.web("#1a237e")
            }
            center {
                button(graphic = ImageView("images/closeButton.png").apply {
                    fitWidth = 120.0
                    fitHeight = 50.0
                }).action {
                    close()
                }
            }
        }

    }
}